app/Controllers/Admin/CMSController.php

SELECT *
FROM `cms_pages`
---
    public function index()
    {
        $data = [
            'title' => 'Content Management - SPK',
            'pages' => $this->cmsModel->findAll()