app/Controllers/Admin/MemberManagementController.php

SELECT *
FROM `users`
WHERE `member_id` = '3'
 LIMIT 1
SELECT *
FROM `users`
WHERE `member_id` = '5'
 LIMIT 1
---
    public function view($id)
    {
        $member = $this->memberModel->getMemberWithDetails($id);

        if (!$member) {
            return redirect()->back()->with('error', 'Anggota tidak ditemukan');
        }

        $data = [
            'title' => 'Detail Anggota - SPK',
            'member' => $member,
            'payment_history' => $this->paymentModel->getMemberPayments($id),
            'user' => $this->userModel->where('member_id', $id)->first()
        ];