app/Controllers/Admin/PaymentManagementController.php

SELECT *
FROM `members`
WHERE `members`.`id` = 3
---
    private function _sendNotificationEmail(int $memberId, string $status, array $data = []): void
    {
        try {
            $member = $this->memberModel->find($memberId);