app/Controllers/Admin/RoleController.php

    public function update($id)
    {
        $rules = [
            'role_name'        => "required|is_unique[roles.role_name,id,{$id}]|alpha_dash",
            'role_description' => 'required',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->roleModel->update($id, [
            'role_name'        => strtolower($this->request->getPost('role_name')),
            'role_description' => $this->request->getPost('role_description'),
            'is_active'        => $this->request->getPost('is_active') ?? 0,
        ]);
---
UPDATE `roles` SET `role_name` = 'pengurus', `role_description` = 'Pengurus serikat dengan akses manajemen SPK', `is_active` = 0, `updated_at` = '2025-09-25 04:15:20'
WHERE `roles`.`id` IN ('2')