app/Controllers/Admin/RoleController.php

SELECT `roles`.`id`, `roles`.`role_name`, `roles`.`role_description`, COUNT(users.id) as user_count
FROM `roles`
LEFT JOIN `users` ON `users`.`role_id` = `roles`.`id`
GROUP BY `roles`.`id`, `roles`.`role_name`, `roles`.`role_description`
---
    public function index()
    {
        // Menggunakan Query Builder untuk mengambil data yang dibutuhkan view
        $roles = $this->roleModel
            ->select('roles.id, roles.role_name, roles.role_description, COUNT(users.id) as user_count') // PERBAIKAN: Hapus alias 'as description'
            ->join('users', 'users.role_id = roles.id', 'left')
            ->groupBy('roles.id, roles.role_name, roles.role_description')
            ->findAll();

SELECT *
FROM `roles`
WHERE `roles`.`id` = '3'
---
    public function permissions($id)
    {
        $role = $this->roleModel->find($id);

SELECT *
FROM `roles`
WHERE `roles`.`id` = '3'
DELETE FROM `role_menu_access`
WHERE `role_id` = '3'
---
    public function updatePermissions($id)
    {
        $role = $this->roleModel->find($id);
        if (!$role) {
            return redirect()->back()->with('error', 'Role tidak ditemukan.');
        }

        // Prevent modifying super admin permissions
        if ($id == 1) {
            return redirect()->back()->with('error', 'Hak akses Super Admin tidak dapat diubah.');
        }

        $permissions = $this->request->getPost('permissions') ?? [];
        $db = \Config\Database::connect();

        try {
            // Begin transaction
            $db->transBegin();

            // 1. Delete all existing permissions for this role
            $db->table('role_menu_access')->where('role_id', $id)->delete();

INSERT INTO `role_menu_access` (`role_id`, `menu_id`, `can_view`, `can_add`, `can_edit`, `can_delete`, `created_at`) VALUES ('3', 1, 1, 0, 0, 0, '2025-09-25 08:04:36')
---
                            'created_at' => date('Y-m-d H:i:s')
                        ];

                        $db->table('role_menu_access')->insert($data);