app/Controllers/Admin/SurveyManagementController.php

SELECT `surveys`.*, `users`.`nama_lengkap` as `creator_name`
FROM `surveys`
LEFT JOIN `users` ON `users`.`id` = `surveys`.`created_by`
ORDER BY `surveys`.`created_at` DESC
---
    public function index()
    {
        $data = [
            'title' => 'Manajemen Survei - SPK',
            'surveys' => $this->surveyModel->findAll()
        ];