app/Helpers/menu_helper.php

SELECT DISTINCT `m`.*
FROM `menus` `m`
LEFT JOIN `role_menu_access` `rma` ON `rma`.`menu_id` = `m`.`id`
WHERE `m`.`is_active` = 1
AND `m`.`parent_id` IS NULL
AND   (
`rma`.`role_id` = 1
AND `rma`.`can_view` = 1
OR 1 = 1
 )
ORDER BY `m`.`menu_order` ASC
---
    function generate_sidebar_menu()
    {
        if (!is_logged_in()) {
            return [];
        }

        $db = \Config\Database::connect();
        $roleId = (int) session()->get('role_id');

        // 1. Ambil menu utama (parent)
        $builder = $db->table('menus m')
            ->select('m.*')
            ->join('role_menu_access rma', 'rma.menu_id = m.id', 'left')
            ->where('m.is_active', 1)
            ->where('m.parent_id IS NULL');

        // Gabungkan kondisi untuk hak akses normal dan super admin
        $builder->groupStart()
            ->where('rma.role_id', $roleId)
            ->where('rma.can_view', 1)
            ->orWhere("{$roleId} = 1") // <-- INI PERBAIKANNYA: Menggunakan raw string
            ->groupEnd();

        $builder->distinct()->orderBy('m.menu_order', 'ASC');

        $menus = $builder->get()->getResultArray();

SELECT DISTINCT `m`.*
FROM `menus` `m`
LEFT JOIN `role_menu_access` `rma` ON `rma`.`menu_id` = `m`.`id`
WHERE `m`.`is_active` = 1
AND `m`.`parent_id` = '1'
AND   (
`rma`.`role_id` = 1
AND `rma`.`can_view` = 1
OR 1 = 1
 )
ORDER BY `m`.`menu_order` ASC
---
    function get_submenus($parentId, $roleId)
    {
        $db = \Config\Database::connect();
        $roleId = (int) $roleId;

        $builder = $db->table('menus m')
            ->select('m.*')
            ->join('role_menu_access rma', 'rma.menu_id = m.id', 'left')
            ->where('m.is_active', 1)
            ->where('m.parent_id', $parentId);

        $builder->groupStart()
            ->where('rma.role_id', $roleId)
            ->where('rma.can_view', 1)
            ->orWhere("{$roleId} = 1") // <-- INI PERBAIKANNYA: Menggunakan raw string
            ->groupEnd();

        $builder->distinct()->orderBy('m.menu_order', 'ASC');

        $submenus = $builder->get()->getResultArray();