app/Controllers/Member/SurveyController.php

SELECT *
FROM `surveys`
WHERE `surveys`.`id` = '5'
---
    public function take($id)
    {
        $memberId = session()->get('member_id');
        if (!$memberId) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu');
        }

        $survey = $this->surveyModel->find($id);

SELECT *
FROM `surveys`
WHERE `surveys`.`id` = '1'
---
    public function submit($id)
    {
        $memberId = session()->get('member_id');
        if (!$memberId) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu');
        }

        $survey = $this->surveyModel->find($id);

SELECT *
FROM `surveys`
WHERE `surveys`.`id` = '3'
---
    public function result($id)
    {
        $memberId = session()->get('member_id');
        if (!$memberId) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu');
        }

        $survey = $this->surveyModel->find($id);