app/Filters/MaintenanceFilter.php

SELECT *
FROM `settings`
WHERE `key` = 'maintenance_mode'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $db = \Config\Database::connect();

        // Get maintenance status from settings
        $setting = $db->table('settings')
            ->where('key', 'maintenance_mode')
            ->get()
            ->getRowArray();