app/Filters/VerifiedFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $session = session();
        $userModel = new \App\Models\UserModel();

        $userId = $session->get('user_id');

        if (!$userId) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu');
        }

        $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'