app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'admin@spk.com'
 LIMIT 1
---
    public function attemptLogin()
    {
        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required|min_length[8]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $result = $this->userModel->authenticate($email, $password);

        if ($result === false) {
            return redirect()->back()->withInput()
                ->with('error', 'Email atau password salah');
        }

        if (isset($result['error'])) {
            return redirect()->back()->withInput()
                ->with('error', $result['error']);