app/Controllers/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `members`
WHERE `status_keanggotaan` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `members`
WHERE `status_keanggotaan` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `members`
WHERE `status_keanggotaan` = 'suspended'
SELECT *
FROM `members`
WHERE `status_keanggotaan` = 'active'
AND `status_keanggotaan` = 'pending'
AND `status_keanggotaan` = 'suspended'
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows` FROM `blog_posts`
SELECT COUNT(*) AS `numrows`
FROM `members`
WHERE `status_keanggotaan` = 'active'
AND `status_keanggotaan` = 'pending'
SELECT *
FROM `members`
ORDER BY `created_at` DESC
 LIMIT 10
---
    private function adminDashboard()
    {
        // Create statistics manually using existing methods
        $statistics = [
            'total' => $this->memberModel->countAll(),
            'active' => $this->memberModel->where('status_keanggotaan', 'active')->countAllResults(),
            'pending' => $this->memberModel->where('status_keanggotaan', 'pending')->countAllResults(),
            'suspended' => $this->memberModel->where('status_keanggotaan', 'suspended')->countAllResults(),
        ];

        // Create payment summary manually using correct column names
        $paymentSummary = [
            'pending' => $this->paymentModel->where('status_pembayaran', 'pending')->countAllResults(),
            'verified' => $this->paymentModel->where('status_pembayaran', 'verified')->countAllResults(),
        ];

        $data = [
            'title' => 'Dashboard Admin - SPK',
            'statistics' => $statistics,
            'payment_summary' => $paymentSummary,
            'recent_members' => $this->memberModel->orderBy('created_at', 'DESC')->limit(10)->findAll(),
            'pending_members' => $this->memberModel->getPendingMembers(), // This method exists
            'pending_payments' => $this->paymentModel->getPendingPayments(), // This method exists
            'pengaduan_stats' => $this->pengaduanModel->getPengaduanStatistics(), // This method exists!
            'total_posts' => $this->blogModel->countAll(),
            'total_threads' => $this->forumModel->countAll()
        ];