app/Controllers/DashboardController.php

    private function pengurusDashboard()
    {
        $data = [
            'title' => 'Dashboard Pengurus - SPK',
            'member_stats' => [
                'total' => $this->memberModel->where('status_keanggotaan', 'active')->countAllResults(),
                'pending' => $this->memberModel->where('status_keanggotaan', 'pending')->countAllResults()
            ],
            'pending_members' => $this->memberModel->getPendingMembers(),
            'pending_posts' => $this->blogModel->getPendingPosts(),
            'open_pengaduan' => $this->pengaduanModel->getPengaduanByStatus('open'),
            'recent_activities' => $this->getRecentActivities(),
            'payment_summary' => $this->paymentModel->getPaymentSummary(date('Y-m-01'), date('Y-m-t'))
        ];
---
SELECT *
FROM `members`
WHERE `status_keanggotaan` = 'pending'