app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `members`
WHERE `status_keanggotaan` = 'active'
SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `kampus_id`
FROM `members`
) CI_count_all_results
SELECT COUNT(*) AS `numrows`
FROM `blog_posts`
WHERE `status` = 'published'
---
    private function getPublicStatistics()
    {
        return [
            'total_members' => $this->memberModel->where('status_keanggotaan', 'active')->countAllResults(),
            'total_kampus' => $this->memberModel->select('kampus_id')->distinct()->countAllResults(),
            'total_posts' => $this->blogModel->where('status', 'published')->countAllResults(),
            'total_events' => $this->informasiModel->where('kategori', 'kegiatan')->where('status', 'published')->countAllResults()
        ];