app/Controllers/MemberController.php

    public function profile()
    {
        $memberId = session()->get('member_id');
        $userId = session()->get('user_id');

        $member = $this->memberModel->getMemberWithDetails($memberId);
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'