app/Models/ActivityLogModel.php

INSERT INTO `activity_logs` (`user_id`, `activity_type`, `activity_description`, `ip_address`, `user_agent`, `created_at`) VALUES ('1', 'GET__index.php_dashboard', 'GET request to /index.php/dashboard', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36 Edg/140.0.0.0', '2025-09-23 14:24:46')
---
    public function logActivity($userId, $type, $description)
    {
        $request = \Config\Services::request();

        return $this->insert([
            'user_id' => $userId,
            'activity_type' => $type,
            'activity_description' => $description,
            'ip_address' => $request->getIPAddress(),
            'user_agent' => $request->getUserAgent()->getAgentString()
        ]);