app/Models/BlogPostModel.php

SELECT `blog_posts`.*, `users`.`username`, `members`.`nama_lengkap` as `author_name`
FROM `blog_posts`
JOIN `users` ON `users`.`id` = `blog_posts`.`author_id`
LEFT JOIN `members` ON `members`.`id` = `users`.`member_id`
WHERE `blog_posts`.`status` = 'published'
ORDER BY `blog_posts`.`published_at` DESC
 LIMIT 3
---
    public function getPublishedPosts($limit = null, $offset = null)
    {
        $builder = $this->select('blog_posts.*, users.username, members.nama_lengkap as author_name')
            ->join('users', 'users.id = blog_posts.author_id')
            ->join('members', 'members.id = users.member_id', 'left')
            ->where('blog_posts.status', 'published')
            ->orderBy('blog_posts.published_at', 'DESC');

        if ($limit !== null) {
            $builder->limit($limit, $offset);
        }

        return $builder->findAll();