app/Models/InformasiSerikatModel.php

SELECT *
FROM `informasi_serikat`
WHERE `status` = 'published'
AND `kategori` = 'berita'
ORDER BY `published_at` DESC
 LIMIT 3
---
    public function getPublished($kategori = null, $limit = null)
    {
        $builder = $this->where('status', 'published')
            ->orderBy('published_at', 'DESC');

        if ($kategori) {
            $builder->where('kategori', $kategori);
        }

        if ($limit) {
            $builder->limit($limit);
        }

        return $builder->findAll();