app/Models/MemberModel.php

SELECT `members`.*, `users`.`email` as `user_email`
FROM `members`
LEFT JOIN `users` ON `users`.`member_id` = `members`.`id`
WHERE `members`.`status_keanggotaan` = 'pending'
ORDER BY `members`.`created_at` ASC
---
    public function getPendingMembers()
    {
        return $this->select('members.*, users.email as user_email')
            ->join('users', 'users.member_id = members.id', 'left')
            ->where('members.status_keanggotaan', 'pending')
            ->orderBy('members.created_at', 'ASC')
            ->findAll();

SELECT `members`.*, `ref_kampus`.`nama_kampus`, `ref_prodi`.`nama_prodi`, `users`.`last_login`
FROM `members`
LEFT JOIN `ref_kampus` ON `ref_kampus`.`id` = `members`.`kampus_id`
LEFT JOIN `ref_prodi` ON `ref_prodi`.`id` = `members`.`prodi_id`
LEFT JOIN `users` ON `users`.`member_id` = `members`.`id`
WHERE `members`.`status_keanggotaan` = 'active'
---
    public function getActiveMembers($limit = null, $offset = null)
    {
        $builder = $this->select('members.*,
                                 ref_kampus.nama_kampus,
                                 ref_prodi.nama_prodi,
                                 users.last_login')
            ->join('ref_kampus', 'ref_kampus.id = members.kampus_id', 'left')
            ->join('ref_prodi', 'ref_prodi.id = members.prodi_id', 'left')
            ->join('users', 'users.member_id = members.id', 'left')
            ->where('members.status_keanggotaan', 'active');

        if ($limit !== null && $offset !== null) {
            $builder->limit($limit, $offset);
        }

        return $builder->findAll();

SELECT COUNT(*) AS `numrows`
FROM `members`
WHERE `status_keanggotaan` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `members`
WHERE `status_keanggotaan` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `members`
WHERE `status_keanggotaan` = 'suspended'
SELECT COUNT(*) AS `numrows`
FROM `members`
WHERE `status_keanggotaan` = 'terminated'
SELECT `jenis_kelamin`, COUNT(*) as total
FROM `members`
WHERE `status_keanggotaan` = 'active'
GROUP BY `jenis_kelamin`
SELECT `ref_kampus`.`nama_kampus`, COUNT(*) as total
FROM `members`
LEFT JOIN `ref_kampus` ON `ref_kampus`.`id` = `members`.`kampus_id`
WHERE `members`.`status_keanggotaan` = 'active'
GROUP BY `members`.`kampus_id`
ORDER BY `total` DESC
 LIMIT 10
SELECT `ref_provinsi`.`nama_provinsi`, COUNT(*) as total
FROM `members`
LEFT JOIN `ref_provinsi` ON `ref_provinsi`.`id` = `members`.`provinsi_id`
WHERE `members`.`status_keanggotaan` = 'active'
GROUP BY `members`.`provinsi_id`
ORDER BY `total` DESC
SELECT *
FROM `members`
WHERE `status_keanggotaan` = 'active'
ORDER BY `tanggal_bergabung` DESC
 LIMIT 5
---
    public function getStatistics()
    {
        $stats = [
            'total' => $this->countAll(),
            'active' => $this->where('status_keanggotaan', 'active')->countAllResults(),
            'pending' => $this->where('status_keanggotaan', 'pending')->countAllResults(),
            'suspended' => $this->where('status_keanggotaan', 'suspended')->countAllResults(),
            'terminated' => $this->where('status_keanggotaan', 'terminated')->countAllResults()
        ];

        // Get by gender
        $stats['by_gender'] = $this->select('jenis_kelamin, COUNT(*) as total')
            ->where('status_keanggotaan', 'active')
            ->groupBy('jenis_kelamin')
            ->findAll();

        // Get by kampus (top 10)
        $stats['by_kampus'] = $this->select('ref_kampus.nama_kampus, COUNT(*) as total')
            ->join('ref_kampus', 'ref_kampus.id = members.kampus_id', 'left')
            ->where('members.status_keanggotaan', 'active')
            ->groupBy('members.kampus_id')
            ->orderBy('total', 'DESC')
            ->limit(10)
            ->findAll();

        // Get by provinsi
        $stats['by_provinsi'] = $this->select('ref_provinsi.nama_provinsi, COUNT(*) as total')
            ->join('ref_provinsi', 'ref_provinsi.id = members.provinsi_id', 'left')
            ->where('members.status_keanggotaan', 'active')
            ->groupBy('members.provinsi_id')
            ->orderBy('total', 'DESC')
            ->findAll();

        // Get recent members
        $stats['recent'] = $this->where('status_keanggotaan', 'active')
            ->orderBy('tanggal_bergabung', 'DESC')
            ->limit(5)
            ->findAll();

SELECT `members`.*, `rk`.`nama_kampus`, `rp`.`nama_prodi`, `rsk`.`nama_status` as `status_kepegawaian`, `u`.`username`, `u`.`is_active` as `user_status`
FROM `members`
LEFT JOIN `ref_kampus` `rk` ON `rk`.`id` = `members`.`kampus_id`
LEFT JOIN `ref_prodi` `rp` ON `rp`.`id` = `members`.`prodi_id`
LEFT JOIN `ref_status_kepegawaian` `rsk` ON `rsk`.`id` = `members`.`status_kepegawaian_id`
LEFT JOIN `users` `u` ON `u`.`member_id` = `members`.`id`
WHERE `members`.`id` = 5
 LIMIT 1
---
    public function getMemberWithDetails(int $id)
    {
        return $this->select('
                members.*,
                rk.nama_kampus,
                rp.nama_prodi,
                rsk.nama_status as status_kepegawaian,
                u.username,
                u.is_active as user_status
            ')
            ->join('ref_kampus rk', 'rk.id = members.kampus_id', 'left')
            ->join('ref_prodi rp', 'rp.id = members.prodi_id', 'left')
            ->join('ref_status_kepegawaian rsk', 'rsk.id = members.status_kepegawaian_id', 'left')
            ->join('users u', 'u.member_id = members.id', 'left')
            ->where('members.id', $id)
            ->first();