app/Models/MenuModel.php

    public function getMenusByRole($roleId)
    {
        $db = \Config\Database::connect();

        return $db->table('menus')
            ->select('menus.*')
            ->join('role_menu_access', 'role_menu_access.menu_id = menus.id', 'left')
            ->where('menus.is_active', 1)
            ->where('menus.parent_id', null)
            ->groupStart()
            ->where('role_menu_access.role_id', $roleId)
            ->where('role_menu_access.can_view', 1)
            ->orWhere($roleId . ' = 1') // Super admin can access all
            ->groupEnd()
            ->orderBy('menus.menu_order', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `menus`.*
FROM `menus`
LEFT JOIN `role_menu_access` ON `role_menu_access`.`menu_id` = `menus`.`id`
WHERE `menus`.`is_active` = 1
AND `menus`.`parent_id` IS NULL
AND   (
`role_menu_access`.`role_id` = '1'
AND `role_menu_access`.`can_view` = 1
OR 1 = 1
 )
ORDER BY `menus`.`menu_order` ASC

    public function getAllParentMenus()
    {
        return $this->where('parent_id', null)
            ->where('is_active', 1)
            ->orderBy('menu_order', 'ASC')
            ->findAll();
---
SELECT *
FROM `menus`
WHERE `parent_id` IS NULL
AND `is_active` = 1
ORDER BY `menu_order` ASC

    public function getSubMenus($parentId, $roleId = null)
    {
        $builder = $this->where('parent_id', $parentId)
            ->where('is_active', 1);

        if ($roleId && $roleId != 1) { // Not super admin
            $db = \Config\Database::connect();
            $menuIds = $db->table('role_menu_access')
                ->select('menu_id')
                ->where('role_id', $roleId)
                ->where('can_view', 1)
                ->get()
                ->getResultArray();

            $ids = array_column($menuIds, 'menu_id');
            if (!empty($ids)) {
                $builder->whereIn('id', $ids);
            } else {
                // No permissions found, return empty
                return [];
            }
        }

        return $builder->orderBy('menu_order', 'ASC')->findAll();
---
SELECT `menu_id`
FROM `role_menu_access`
WHERE `role_id` = '3'
AND `can_view` = 1
SELECT *
FROM `menus`
WHERE `parent_id` = '1'
AND `is_active` = 1
AND `id` IN ('1','6','7','8','9','10','11','12','13','14')
ORDER BY `menu_order` ASC

    public function buildMenuTreeForPermissions()
    {
        // Get all parent menus
        $menus = $this->getAllParentMenus();

        // Add all submenus to each parent menu (no role filtering)
        foreach ($menus as &$menu) {
            $menu['submenus'] = $this->where('parent_id', $menu['id'])
                ->where('is_active', 1)
                ->orderBy('menu_order', 'ASC')
                ->findAll();
---
SELECT *
FROM `menus`
WHERE `parent_id` = '1'
AND `is_active` = 1
ORDER BY `menu_order` ASC