app/Models/MenuModel.php

SELECT `menus`.*
FROM `menus`
JOIN `role_menu_access` ON `role_menu_access`.`menu_id` = `menus`.`id`
WHERE `role_menu_access`.`role_id` IS NULL
AND `role_menu_access`.`can_view` = 1
AND `menus`.`is_active` = 1
AND `menus`.`parent_id` IS NULL
ORDER BY `menus`.`menu_order` ASC
---
    public function getMenusByRole($roleId)
    {
        $db = \Config\Database::connect();

        return $db->table('menus')
            ->select('menus.*')
            ->join('role_menu_access', 'role_menu_access.menu_id = menus.id')
            ->where('role_menu_access.role_id', $roleId)
            ->where('role_menu_access.can_view', 1)
            ->where('menus.is_active', 1)
            ->where('menus.parent_id', null)
            ->orderBy('menus.menu_order', 'ASC')
            ->get()
            ->getResultArray();