app/Models/PaymentHistoryModel.php

SELECT *
FROM `payment_history`
WHERE `member_id` = '3'
ORDER BY `tanggal_pembayaran` DESC
---
    public function getMemberPayments($memberId)
    {
        return $this->where('member_id', $memberId)
            ->orderBy('tanggal_pembayaran', 'DESC')
            ->paginate(10);

SELECT `payment_history`.*, `members`.`nama_lengkap`, `members`.`nomor_anggota`
FROM `payment_history`
JOIN `members` ON `members`.`id` = `payment_history`.`member_id`
WHERE `payment_history`.`status_pembayaran` = 'pending'
ORDER BY `payment_history`.`created_at` DESC
---
    public function getPendingPayments()
    {
        return $this->select('payment_history.*, members.nama_lengkap, members.nomor_anggota')
            ->join('members', 'members.id = payment_history.member_id')
            ->where('payment_history.status_pembayaran', 'pending')
            ->orderBy('payment_history.created_at', 'DESC')
            ->findAll();