app/Models/PengaduanModel.php

SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` = 'open'
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` = 'in_progress'
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` = 'resolved'
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` = 'closed'
SELECT COUNT(*) AS `numrows` FROM `pengaduan`
SELECT `kategori`, COUNT(id) as total
FROM `pengaduan`
GROUP BY `kategori`
SELECT `priority`, COUNT(id) as total
FROM `pengaduan`
WHERE `status` != 'closed'
GROUP BY `priority`
---
    public function getPengaduanStatistics()
    {
        $db = \Config\Database::connect();

        return [
            'total' => $this->countAll(),
            'open' => $this->where('status', 'open')->countAllResults(),
            'in_progress' => $this->where('status', 'in_progress')->countAllResults(),
            'resolved' => $this->where('status', 'resolved')->countAllResults(),
            'closed' => $this->where('status', 'closed')->countAllResults(),
            'by_category' => $db->table('pengaduan')
                ->select('kategori, COUNT(id) as total')
                ->groupBy('kategori')
                ->get()
                ->getResultArray(),
            'by_priority' => $db->table('pengaduan')
                ->select('priority, COUNT(id) as total')
                ->where('status !=', 'closed')
                ->groupBy('priority')
                ->get()
                ->getResultArray()