app/Models/RoleModel.php

SELECT *
FROM `roles`
WHERE `roles`.`id` = '3'
SELECT `role_menu_access`.*, `menus`.`menu_name`, `menus`.`menu_url`, `menus`.`menu_icon`
FROM `role_menu_access`
JOIN `menus` ON `menus`.`id` = `role_menu_access`.`menu_id`
WHERE `role_menu_access`.`role_id` = '3'
---
    public function getRoleWithPermissions($roleId)
    {
        $role = $this->find($roleId);
        if (!$role) return null;

        $db = \Config\Database::connect();
        $permissions = $db->table('role_menu_access')
            ->select('role_menu_access.*, menus.menu_name, menus.menu_url, menus.menu_icon')
            ->join('menus', 'menus.id = role_menu_access.menu_id')
            ->where('role_menu_access.role_id', $roleId)
            ->get()
            ->getResultArray();