app/Models/SurveyAnswerModel.php

SELECT *
FROM `survey_questions`
WHERE `id` = '13'
---
    public function getAnswerDistribution($questionId)
    {
        $db = \Config\Database::connect();

        // Get question type first
        $question = $db->table('survey_questions')
            ->where('id', $questionId)
            ->get()
            ->getRowArray();

SELECT `answer_text` as `value`, COUNT(*) as count, ROUND(COUNT(*) * 100.0 / (SELECT COUNT(*) FROM survey_answers WHERE question_id = 13), 2) as percentage
FROM `survey_answers`
WHERE `question_id` = '13'
AND `answer_text` != ''
GROUP BY `answer_text`
ORDER BY `count` DESC
---
    private function getChoiceDistribution($questionId)
    {
        $db = \Config\Database::connect();

        return $db->table($this->table)
            ->select('answer_text as value, COUNT(*) as count, ROUND(COUNT(*) * 100.0 / (SELECT COUNT(*) FROM survey_answers WHERE question_id = ' . $questionId . '), 2) as percentage')
            ->where('question_id', $questionId)
            ->where('answer_text !=', '')
            ->groupBy('answer_text')
            ->orderBy('count', 'DESC')
            ->get()
            ->getResultArray();

SELECT *
FROM `survey_answers`
WHERE `question_id` = '16'
AND `answer_text` != ''
---
    private function getMultiChoiceDistribution($questionId)
    {
        $db = \Config\Database::connect();

        $answers = $this->where('question_id', $questionId)
            ->where('answer_text !=', '')
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `survey_answers`
WHERE `question_id` = '15'
AND `answer_text` = '1'
---
    private function getRatingDistribution($questionId, $question)
    {
        $db = \Config\Database::connect();

        $min = $question['min_value'] ?? 1;
        $max = $question['max_value'] ?? 5;

        $distribution = [];
        $total = 0;
        $sum = 0;

        for ($i = $min; $i <= $max; $i++) {
            $count = $this->where('question_id', $questionId)
                ->where('answer_text', $i)
                ->countAllResults();

SELECT MIN(CAST(answer_text AS DECIMAL(10, 2))) as min, MAX(CAST(answer_text AS DECIMAL(10, 2))) as max, AVG(CAST(answer_text AS DECIMAL(10, 2))) as average, COUNT(*) as count, STDDEV(CAST(answer_text AS DECIMAL(10, 2))) as std_dev
FROM `survey_answers`
WHERE `question_id` = '14'
AND `answer_text` != ''
AND answer_text REGEXP '^[0-9]+\.?[0-9]*$'
SELECT CAST(answer_text AS DECIMAL(10, 2)) as value
FROM `survey_answers`
WHERE `question_id` = '14'
AND `answer_text` != ''
AND answer_text REGEXP '^[0-9]+\.?[0-9]*$'
ORDER BY `value` ASC
---
    private function getNumberDistribution($questionId)
    {
        $db = \Config\Database::connect();

        $stats = $db->table($this->table)
            ->select('
                MIN(CAST(answer_text AS DECIMAL(10,2))) as min,
                MAX(CAST(answer_text AS DECIMAL(10,2))) as max,
                AVG(CAST(answer_text AS DECIMAL(10,2))) as average,
                COUNT(*) as count,
                STDDEV(CAST(answer_text AS DECIMAL(10,2))) as std_dev
            ')
            ->where('question_id', $questionId)
            ->where('answer_text !=', '')
            ->where('answer_text REGEXP', '^[0-9]+\.?[0-9]*$')
            ->get()
            ->getRowArray();

        // Get median
        $values = $db->table($this->table)
            ->select('CAST(answer_text AS DECIMAL(10,2)) as value')
            ->where('question_id', $questionId)
            ->where('answer_text !=', '')
            ->where('answer_text REGEXP', '^[0-9]+\.?[0-9]*$')
            ->orderBy('value', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `survey_answers`
WHERE `question_id` = '18'
AND `answer_text` != ''
ORDER BY `created_at` DESC
---
    private function getTextAnswers($questionId, $limit = 10)
    {
        $answers = $this->where('question_id', $questionId)
            ->where('answer_text !=', '')
            ->orderBy('created_at', 'DESC')
            ->findAll();