app/Models/SurveyQuestionModel.php

    public function getQuestionsBySurvey($surveyId)
    {
        $questions = $this->where('survey_id', $surveyId)
            ->orderBy('order_number', 'ASC')
            ->findAll();
---
SELECT *
FROM `survey_questions`
WHERE `survey_id` = '1'
ORDER BY `order_number` ASC

    public function validateAnswer($questionId, $answer)
    {
        $question = $this->find($questionId);
---
SELECT *
FROM `survey_questions`
WHERE `survey_questions`.`id` = '1'