app/Models/SurveyModel.php

SELECT *
FROM `surveys`
WHERE `surveys`.`id` = '3'
SELECT *
FROM `survey_questions`
WHERE `survey_id` = '3'
ORDER BY `order_number` ASC
---
    public function getSurveyWithQuestions($surveyId)
    {
        $survey = $this->find($surveyId);
        if (!$survey) return null;

        $db = \Config\Database::connect();
        $questions = $db->table('survey_questions')
            ->where('survey_id', $surveyId)
            ->orderBy('order_number', 'ASC')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `survey_responses`
WHERE `survey_id` = '3'
SELECT COUNT(*) AS `numrows`
FROM `members`
WHERE `status_keanggotaan` = 'active'
SELECT *
FROM `survey_questions`
WHERE `survey_id` = '3'
ORDER BY `order_number` ASC
---
    public function getSurveyStatistics($surveyId)
    {
        $db = \Config\Database::connect();

        // Total responses
        $totalResponses = $db->table('survey_responses')
            ->where('survey_id', $surveyId)
            ->countAllResults();

        // Total members who haven't responded
        $totalMembers = $db->table('members')
            ->where('status_keanggotaan', 'active') // PERBAIKAN: Mengganti 'status' menjadi 'status_keanggotaan'
            ->countAllResults();

        $responseRate = $totalMembers > 0 ? round(($totalResponses / $totalMembers) * 100, 2) : 0;

        // Get questions with answer statistics
        $questions = $db->table('survey_questions')
            ->where('survey_id', $surveyId)
            ->orderBy('order_number', 'ASC')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `survey_answers`
WHERE `question_id` = '13'
---
    private function getQuestionStatistics($question)
    {
        $db = \Config\Database::connect();

        $question['total_answers'] = $db->table('survey_answers')
            ->where('question_id', $question['id'])
            ->countAllResults();

SELECT `answer_text`, COUNT(*) as count
FROM `survey_answers`
WHERE `question_id` = '13'
GROUP BY `answer_text`
ORDER BY `count` DESC
---
    private function getChoiceDistribution($questionId)
    {
        $db = \Config\Database::connect();

        $answers = $db->table('survey_answers')
            ->select('answer_text, COUNT(*) as count')
            ->where('question_id', $questionId)
            ->groupBy('answer_text')
            ->orderBy('count', 'DESC')
            ->get()
            ->getResultArray();

SELECT AVG(CAST(answer_text AS UNSIGNED)) AS `average`
FROM `survey_answers`
WHERE `question_id` = '19'
---
    private function getAverageRating($questionId)
    {
        $db = \Config\Database::connect();

        $result = $db->table('survey_answers')
            ->selectAvg('CAST(answer_text AS UNSIGNED)', 'average')
            ->where('question_id', $questionId)
            ->get()
            ->getRowArray();

SELECT COUNT(*) AS `numrows`
FROM `survey_answers`
WHERE `question_id` = '19'
AND `answer_text` = 1
---
    private function getRatingDistribution($questionId)
    {
        $db = \Config\Database::connect();

        $distribution = [];
        for ($i = 1; $i <= 5; $i++) {
            $count = $db->table('survey_answers')
                ->where('question_id', $questionId)
                ->where('answer_text', $i)
                ->countAllResults();

SELECT MIN(CAST(answer_text AS DECIMAL(10, 2))) as min, MAX(CAST(answer_text AS DECIMAL(10, 2))) as max, AVG(CAST(answer_text AS DECIMAL(10, 2))) as average, COUNT(*) as count
FROM `survey_answers`
WHERE `question_id` = '14'
---
    private function getNumberStatistics($questionId)
    {
        $db = \Config\Database::connect();

        $result = $db->table('survey_answers')
            ->select('
                MIN(CAST(answer_text AS DECIMAL(10,2))) as min,
                MAX(CAST(answer_text AS DECIMAL(10,2))) as max,
                AVG(CAST(answer_text AS DECIMAL(10,2))) as average,
                COUNT(*) as count
            ')
            ->where('question_id', $questionId)
            ->get()
            ->getRowArray();

SELECT `answer_text`, `created_at`
FROM `survey_answers`
WHERE `question_id` = '15'
AND `answer_text` != ''
ORDER BY `created_at` DESC
 LIMIT 5
---
    private function getSampleAnswers($questionId, $limit = 5)
    {
        $db = \Config\Database::connect();

        return $db->table('survey_answers')
            ->select('answer_text, created_at')
            ->where('question_id', $questionId)
            ->where('answer_text !=', '')
            ->orderBy('created_at', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `surveys`
WHERE `is_active` = 1
AND `start_date` <= '2025-09-26 18:24:46'
AND `end_date` >= '2025-09-26 18:24:46'
SELECT COUNT(*) AS `numrows`
FROM `surveys`
WHERE `is_active` = 1
AND `start_date` > '2025-09-26 18:24:46'
SELECT COUNT(*) AS `numrows`
FROM `survey_responses`
---
    public function getSurveySummary()
    {
        $now = date('Y-m-d H:i:s');
        $db = \Config\Database::connect();

        return [
            'total_surveys' => $this->countAllResults(),
            'active_surveys' => $this->where('is_active', 1)
                ->where('start_date <=', $now)
                ->where('end_date >=', $now)
                ->countAllResults(),
            'upcoming_surveys' => $this->where('is_active', 1)
                ->where('start_date >', $now)
                ->countAllResults(),
            'total_responses' => $db->table('survey_responses')
                ->countAllResults()