app/Models/SurveyResponseModel.php

SELECT *
FROM `survey_responses`
WHERE `survey_responses`.`id` = '4'
SELECT `sa`.*, `sq`.`question_text`, `sq`.`question_type`
FROM `survey_answers` `sa`
JOIN `survey_questions` `sq` ON `sq`.`id` = `sa`.`question_id`
WHERE `sa`.`response_id` = '4'
ORDER BY `sq`.`order_number` ASC
---
    public function getResponseWithAnswers($responseId)
    {
        $response = $this->find($responseId);
        if (!$response) return null;

        $db = \Config\Database::connect();
        $answers = $db->table('survey_answers sa')
            ->select('sa.*, sq.question_text, sq.question_type')
            ->join('survey_questions sq', 'sq.id = sa.question_id')
            ->where('sa.response_id', $responseId)
            ->orderBy('sq.order_number', 'ASC')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `survey_responses`
WHERE `survey_id` = '3'
AND `member_id` = '3'
AND `is_complete` = 1
---
    public function hasResponded($surveyId, $memberId)
    {
        return $this->where('survey_id', $surveyId)
            ->where('member_id', $memberId)
            ->where('is_complete', 1)
            ->countAllResults() > 0;

SELECT *
FROM `survey_responses`
WHERE `survey_id` = '6'
AND `member_id` = '3'
AND `is_complete` = 1
 LIMIT 1
---
    public function getMemberResponse($surveyId, $memberId)
    {
        $response = $this->where('survey_id', $surveyId)
            ->where('member_id', $memberId)
            ->where('is_complete', 1)
            ->first();

SELECT *
FROM `survey_responses`
WHERE `survey_id` = '5'
AND `member_id` = '3'
AND `is_complete` = 0
 LIMIT 1
---
    public function getPartialResponse($surveyId, $memberId)
    {
        $response = $this->where('survey_id', $surveyId)
            ->where('member_id', $memberId)
            ->where('is_complete', 0)
            ->first();