app/Models/UserModel.php

SELECT `users`.*, `roles`.`role_name`, `roles`.`role_description`, `members`.`nama_lengkap`, `members`.`nomor_anggota`, `members`.`foto_path`
FROM `users`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
LEFT JOIN `members` ON `members`.`id` = `users`.`member_id`
WHERE `users`.`id` = '1'
 LIMIT 1
---
    public function getUserComplete($userId)
    {
        return $this->select('users.*, roles.role_name, members.nama_lengkap as member_name, members.nomor_anggota')
            ->join('roles', 'roles.id = users.role_id', 'left')
            ->join('members', 'members.id = users.member_id', 'left')
            ->where('users.id', $userId)
            ->first();