app/Libraries/Authentication.php

    public function attemptLogin(string $email, string $password, bool $remember = false): array
    {
        try {
            // Get user by email
            $user = $this->userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@spk.com'
 LIMIT 1

    protected function resetLoginAttempts(int $userId): void
    {
        $this->userModel->update($userId, [
            'login_attempts' => 0,
            'locked_until' => null
        ]);
---
UPDATE `users` SET `login_attempts` = 0, `locked_until` = NULL, `updated_at` = '2025-09-24 05:36:06'
WHERE `users`.`id` IN (1)

    protected function logActivity(?int $userId, string $type, array $data = []): void
    {
        try {
            $this->activityLog->insert([
                'user_id' => $userId,
                'activity_type' => $type,
                'activity_details' => json_encode($data),
                'ip_address' => $this->getClientIP(),
                'user_agent' => $_SERVER['HTTP_USER_AGENT'] ?? 'Unknown'
            ]);
---
INSERT INTO `activity_logs` (`user_id`, `activity_type`, `activity_details`, `ip_address`, `user_agent`) VALUES (1, 'login_success', '[]', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/140.0.0.0 Safari/537.36 Edg/140.0.0.0')